ConfigFiles/Catalogs/ЗадачиПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДлительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтработкиПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредшествующиеЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредшествующаяЗадача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПротоколВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПоручения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительПоручения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ЗадачиПроцесса/Forms/ПредшествующиеЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ПредшествующиеЗадачи")
		Или ТипЗнч(Параметры.ПредшествующиеЗадачи) <> Тип("Массив") Тогда
		 Отказ = Истина;
		 Возврат;
	КонецЕсли;
	
	Предмет = Параметры.Предмет;
	ТекущаяЗадача  = Параметры.ТекущаяЗадача;
	ЗадачаРодитель = Параметры.ЗадачаРодитель;
	
	Если НЕ Параметры.Доступность Тогда
		Элементы.ПредшествующиеЗадачи.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Для Каждого ПредшествующаяЗадача Из Параметры.ПредшествующиеЗадачи Цикл
		НоваяСтрока = ПредшествующиеЗадачи.Добавить();
		НоваяСтрока.ПредшествующаяЗадача = ПредшествующаяЗадача;
		НоваяСтрока.НомерСтроки          = ПредшествующиеЗадачи.Количество();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И Модифицированность И Не ПереноситьИзменения И Не ЗавершениеРаботы Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстПредупреждения = НСтр("ru = 'Состав предшествующих задач был изменен. Перенести изменения?'");
		
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредшествующиеЗадачи

&НаКлиенте
Процедура ПредшествующиеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ОткрытьФормуВыбораЗадачи(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеЗадачиПредшествующаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуВыбораЗадачи(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредшествующиеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПредшествующиеЗадачи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.ПредшествующаяЗадача);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ТолькоПросмотр Тогда
		ПереноситьИзменения = Истина;
	КонецЕсли;
	
	Закрыть(МассивПредшествующихЗадач());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция МассивПредшествующихЗадач()
	
	МассивПредшествующихЗадач = Новый Массив;
	
	Для Каждого СтрокаПредшествующаяЗадача Из ПредшествующиеЗадачи Цикл
		
		Если МассивПредшествующихЗадач.Найти(СтрокаПредшествующаяЗадача.ПредшествующаяЗадача) = Неопределено Тогда
			МассивПредшествующихЗадач.Добавить(СтрокаПредшествующаяЗадача.ПредшествующаяЗадача);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПредшествующихЗадач;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораЗадачи(ДобавлениеЗадачи)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыбора", Истина);
	ПараметрыФормы.Вставить("ПараметрыВыбораЗадачи", ПараметрыВыбораЗадачи());
	
	СтруктураБыстрогоОтбора = Новый Структура;
	СтруктураБыстрогоОтбора.Вставить("Предмет", Предмет);
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДобавлениеЗадачи", ДобавлениеЗадачи);
	
	ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ФормаВыбораЗадачиПроцессаПослеВыбора", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ЗадачиПроцесса.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,,ОбработчикЗакрытияФормы);

КонецПроцедуры

&НаКлиенте
Функция ПараметрыВыбораЗадачи()

	ПараметрыВыбораЗадачи      = ЗадачиПроцессовКлиент.ПараметрыВыбораЗадачи();
	ПустаяСсылкаЗадачаПроцесса = ПредопределенноеЗначение("Справочник.ЗадачиПроцесса.ПустаяСсылка");
	
	Если ТекущаяЗадача = ПустаяСсылкаЗадачаПроцесса Тогда
		
		Если ЗадачаРодитель = ПустаяСсылкаЗадачаПроцесса Тогда
		
			ПараметрыВыбораЗадачи.ИсключатьПодчиненныеЗадачи = Ложь;
			ПараметрыВыбораЗадачи.ИсключатьВышестоящиеЗадачи = Ложь;
		
		Иначе
			
			ПараметрыВыбораЗадачи.ИсключатьПодчиненныеЗадачи = Ложь;
			ПараметрыВыбораЗадачи.ИсключатьВышестоящиеЗадачи = Истина;
			ПараметрыВыбораЗадачи.ТекущаяЗадача              = ЗадачаРодитель;
		КонецЕсли;
		
	Иначе
		
		ПараметрыВыбораЗадачи.ТекущаяЗадача = ТекущаяЗадача;
		
		Если ЗадачаРодитель = ПустаяСсылкаЗадачаПроцесса Тогда
			
			ПараметрыВыбораЗадачи.ИсключатьПодчиненныеЗадачи = Истина;
			ПараметрыВыбораЗадачи.ИсключатьВышестоящиеЗадачи = Ложь;
			
		Иначе
			
			ПараметрыВыбораЗадачи.ИсключатьПодчиненныеЗадачи = Истина;
			ПараметрыВыбораЗадачи.ИсключатьВышестоящиеЗадачи = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаПредшествующиеЗадача Из ПредшествующиеЗадачи Цикл
		
		ПараметрыВыбораЗадачи.УжеПодобранныеЗадачи.Добавить(СтрокаПредшествующиеЗадача.ПредшествующаяЗадача);
		
	КонецЦикла;
	
	Возврат ПараметрыВыбораЗадачи;

КонецФункции 

&НаКлиенте
Процедура ФормаВыбораЗадачиПроцессаПослеВыбора(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДобавлениеЗадачи Тогда
		
		НоваяСтрока = ПредшествующиеЗадачи.Добавить();
		НоваяСтрока.НомерСтроки = ПредшествующиеЗадачи.Количество();
		НоваяСтрока.ПредшествующаяЗадача = РезультатВыбора;
		
		Модифицированность = Истина;
		
	Иначе
		ТекущиеДанные = Элементы.ПредшествующиеЗадачи.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено 
			И ТекущиеДанные.ПредшествующаяЗадача <> РезультатВыбора Тогда
			
			ТекущиеДанные.ПредшествующаяЗадача = РезультатВыбора;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыполняетсяЗакрытие = Истина;
	ПереноситьИзменения  = Истина;
	Закрыть(МассивПредшествующихЗадач());
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ВыполняетсяЗакрытие = Ложь;

#КонецОбласти
